; domain
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;;; PUERTO Ejercicio 1 de Daniel P. y Alejandro G.
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

(define (domain puerto)
  (:requirements :strips :typing)
  (:types cinta muelle grua pila altura contenedor - object)
  (:predicates 
		; Indica si un contenedor es verde
		(verde ?c - contenedor)

		; Indica si un contenedor es blanco (no verde)
		(no-verde ?x - (either pila contenedor))

		; Indica si una cinta o grua estan libres, es decir, sin contenedor
		(libre ?x - (either cinta grua))

		; Indica que contenedor1 esta sobre contenedor2, o en caso de no tener contenedor
		; abajo tiene la pila
		(encima ?c - contenedor ?x - (either pila contenedor))

		; Indica si una grua, pila o contenedor se encuentra en una cinta, muelle, grua o pila
		(ubicado-en ?x1 - (either grua pila contenedor) ?x2 - (either cinta muelle grua pila))

		; Indica cuando un contenedor puede ser cogido por la grua. Se permite el tipo pila
		; porque cuando se deja un contenedor en una pila hay que poner como no disponible
		; el contenedor que queda abajo, pero en caso de estar la pila vacia se necesita que
		; este predicado acepte el tipo pila
		(disponible ?x - (either pila contenedor))

		; Indica el contenedor que es el top de la pila, en caso de estar vacia la pila, la
		; pila es el top de la propia pila
		(top ?x - (either pila contenedor) ?pila2 - pila)

		; La cinta conecta muelle origen con muelle destino
		(conecta_a ?ct - cinta ?m_o - muelle ?m_d - muelle)

		; Este predica se utiliza para controlar la altura maxima de las pilas
		(next ?a1 - altura ?a2 - altura)

		; Indica la altura actual de la pila
		(altura ?p - pila ?t - altura)

  )

  (:action coger-pila
		:parameters (
			?muelle - muelle
			?grua - grua
			?pila - pila
			?contenedor - contenedor
			?altura_pila - altura
			?objeto_base - (either pila contenedor)
			?altura_anterior - altura
		)
		:precondition (
			and
			(libre ?grua)
			(ubicado-en ?grua ?muelle)
			(ubicado-en ?pila ?muelle)
			(ubicado-en ?contenedor ?pila)
			(ubicado-en ?objeto_base ?pila)
			(top ?contenedor ?pila)
			(encima ?contenedor ?objeto_base)
			(disponible ?contenedor)
			(altura ?pila ?altura_pila)
			(next ?altura_anterior ?altura_pila)
		)
		:effect(
			and
			(not (libre ?grua))
			(ubicado-en ?contenedor ?grua)
			(not (ubicado-en ?contenedor ?pila))
			(not (top ?contenedor ?pila))
			(not (encima ?contenedor ?objeto_base))
			(not (disponible ?contenedor))
			(disponible ?objeto_base)
			(top ?objeto_base ?pila)
			(not (altura ?pila ?altura_pila))
			(altura ?pila ?altura_anterior)
		)
  )

  (:action dejar-blanco-pila
		:parameters (
			?muelle - muelle
			?grua - grua
			?pila - pila
			?contenedor - contenedor
			?altura_pila - altura
			?objeto_base - (either pila contenedor)
			?altura_posterior - altura
		)
		:precondition(
			and
			(ubicado-en ?grua ?muelle)
			(ubicado-en ?pila ?muelle)
			(ubicado-en ?contenedor ?grua)
			(ubicado-en ?objeto_base ?pila)
			(top ?objeto_base ?pila)
			(no-verde ?objeto_base)
			(altura ?pila ?altura_pila)
			(next ?altura_pila ?altura_posterior)
		)
		:effect(
			and
			(libre ?grua)
			(ubicado-en ?contenedor ?pila)
			(not (ubicado-en ?contenedor ?grua))
			(encima ?contenedor ?objeto_base)
			(top ?contenedor ?pila)
			(not (top ?objeto_base ?pila))
			(altura ?pila ?altura_posterior)
			(not (altura ?pila ?altura_pila))
			(disponible ?contenedor)
			(not (disponible ?objeto_base))
		)
  )

  (:action dejar-verde-verde
		:parameters (
			?muelle - muelle
			?grua - grua
			?pila - pila
			?contenedor_grua - contenedor
			?altura_pila - altura
			?contenedor_pila - contenedor
			?altura_posterior - altura
		)
		:precondition(
			and
			(ubicado-en ?grua ?muelle)
			(ubicado-en ?pila ?muelle)
			(ubicado-en ?contenedor_grua ?grua)
			(ubicado-en ?contenedor_pila ?pila)
			(top ?contenedor_pila ?pila)
			(verde ?contenedor_grua)
			(verde ?contenedor_pila)
			(altura ?pila ?altura_pila)
			(next ?altura_pila ?altura_posterior)
		)
		:effect(
			and
			(libre ?grua)
			(ubicado-en ?contenedor_grua ?pila)
			(not (ubicado-en ?contenedor_grua ?grua))
			(encima ?contenedor_grua ?contenedor_pila)
			(top ?contenedor_grua ?pila)
			(not (top ?contenedor_pila ?pila))
			(altura ?pila ?altura_posterior)
			(not (altura ?pila ?altura_pila))
			(disponible ?contenedor_grua)
		)
  )

  (:action coger-cinta
	    :parameters (
	    	?cinta - cinta
	    	?muelle_origen - muelle
	    	?muelle_destino - muelle
	    	?grua - grua
	    	?contenedor - contenedor
	    )
		:precondition(
			and
			(libre ?grua)
			(ubicado-en ?grua ?muelle_destino)
			(conecta_a ?cinta ?muelle_origen ?muelle_destino)
			(ubicado-en ?contenedor ?cinta)
		)
		:effect(
			and
			(libre ?cinta)
			(ubicado-en ?contenedor ?grua)
			(not (ubicado-en ?contenedor ?cinta))
			(not (libre ?grua))
			(ubicado-en ?contenedor ?muelle_destino)
		)
  )

  (:action dejar-cinta
	    :parameters (
	    	?cinta - cinta
	    	?muelle_origen - muelle
	    	?muelle_destino - muelle
	    	?grua - grua
	    	?contenedor - contenedor
	    )
		:precondition(
			and
			(libre ?cinta)
			(conecta_a ?cinta ?muelle_origen ?muelle_destino)
			(ubicado-en ?grua ?muelle_origen)
			(ubicado-en ?contenedor ?grua)
			(ubicado-en ?contenedor ?muelle_origen)
		)
		:effect(
			and
			(libre ?grua)
			(not (ubicado-en ?contenedor ?grua))
			(ubicado-en ?contenedor ?cinta)
			(not (libre ?cinta))
			(not (ubicado-en ?contenedor ?muelle_origen))
		)
  )
)

; problem
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;;; PUERTO Prob. Correo Eva de Daniel P. y Alejandro G.
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

(define (problem problema_simple) 
(:domain puerto)
(:objects 
    grua1 - grua
    grua2 - grua

    pila1 - pila
    pila2 - pila
    pila3 - pila
    pila4 - pila

    muelle1 - muelle
    muelle2 - muelle

    cinta1 - cinta
    cinta2 - cinta

    contenedor1 - contenedor
    contenedor2 - contenedor
    contenedor3 - contenedor
    contenedor4 - contenedor

    altura_muelle1_0 - altura
    altura_muelle1_1 - altura

    altura_muelle2_0 - altura
    altura_muelle2_1 - altura
)

(:init
    ; Muelle donde se encuentra cada contenedor
    (ubicado-en contenedor1 muelle2)
    (ubicado-en contenedor2 muelle2)
    (ubicado-en contenedor3 muelle1)

    ; Contenedores en sus pilas
    (ubicado-en contenedor1 pila1)
    (ubicado-en contenedor2 pila2)
    (ubicado-en contenedor3 pila3)

    ; Pilas en sus muelles
    (ubicado-en pila1 muelle2)
    (ubicado-en pila2 muelle2)
    (ubicado-en pila3 muelle1)
    (ubicado-en pila4 muelle1)

    ; Orden de los contenedores en cada pila
    (encima contenedor2 pila2)
    (encima contenedor1 pila1)
    (encima contenedor3 pila3)

    ; Gruas en sus muelles
    (ubicado-en grua1 muelle1)
    (ubicado-en grua2 muelle2)

    ; Conexion carriles de cinta
    (conecta_a cinta1 muelle1 muelle2)
    (conecta_a cinta2 muelle2 muelle1)

    ; Tops de las pilas
    (top contenedor1 pila1)
    (top contenedor2 pila2)
    (top contenedor3 pila3)
    (top pila4 pila4)

    ; Control de alturas
    ; Muelle 1
    (next altura_muelle1_0 altura_muelle1_1)

    ; Muelle 2
    (next altura_muelle2_0 altura_muelle2_1)

    ; Gruas y carriles de cinta libres
    (libre grua1)
    (libre grua2)
    (libre cinta1)
    (libre cinta2)

    ; Altura actual de cada pila contando sus contenedores
    (altura pila1 altura_muelle2_1)
    (altura pila2 altura_muelle2_1)
    (altura pila3 altura_muelle1_1)
    (altura pila4 altura_muelle1_0)

    ; Contendores disponibles
    (disponible contenedor1)
    (disponible contenedor2)
    (disponible contenedor3)

    ; Contenedores verdes
    (verde contenedor1)
    (verde contenedor2)

    ; Contenedores no verdes
    (no-verde contenedor3)

    ; Hay que marcar que las pilas son no verdes
    (no-verde pila1)
    (no-verde pila2)
    (no-verde pila3)
    (no-verde pila4)

    ; Hay que ubicar una pila en si misma para poder dejar contenedores en pilas vacias
    (ubicado-en pila1 pila1)
    (ubicado-en pila2 pila2)
    (ubicado-en pila3 pila3)
    (ubicado-en pila4 pila4)
)

(:goal (and

    (ubicado-en contenedor1 muelle1)
    (ubicado-en contenedor2 muelle1)

    (disponible contenedor1)
    (disponible contenedor2)
))

)

; plan
1. (coger-pila muelle2 grua2 pila2 contenedor2 altura_muelle2_1 pila2 altura_muelle2_0)
   deleted: (libre grua2) (ubicado-en contenedor2 pila2) (top contenedor2 pila2) (encima contenedor2 pila2) (disponible contenedor2) (altura pila2 altura_muelle2_1)
   added: (ubicado-en contenedor2 grua2) (disponible pila2) (top pila2 pila2) (altura pila2 altura_muelle2_0)
   goals met: 1 of 4
2. (dejar-cinta cinta2 muelle2 muelle1 grua2 contenedor2)
   deleted: (ubicado-en contenedor2 grua2) (libre cinta2) (ubicado-en contenedor2 muelle2)
   added: (libre grua2) (ubicado-en contenedor2 cinta2)
   goals met: 1 of 4
3. (coger-cinta cinta2 muelle2 muelle1 grua1 contenedor2)
   deleted: (ubicado-en contenedor2 cinta2) (libre grua1)
   added: (libre cinta2) (ubicado-en contenedor2 grua1) (ubicado-en contenedor2 muelle1)
   goals met: 2 of 4
4. (coger-pila muelle2 grua2 pila1 contenedor1 altura_muelle2_1 pila1 altura_muelle2_0)
   deleted: (libre grua2) (ubicado-en contenedor1 pila1) (top contenedor1 pila1) (encima contenedor1 pila1) (disponible contenedor1) (altura pila1 altura_muelle2_1)
   added: (ubicado-en contenedor1 grua2) (disponible pila1) (top pila1 pila1) (altura pila1 altura_muelle2_0)
   goals met: 1 of 4
5. (dejar-cinta cinta2 muelle2 muelle1 grua2 contenedor1)
   deleted: (ubicado-en contenedor1 grua2) (libre cinta2) (ubicado-en contenedor1 muelle2)
   added: (libre grua2) (ubicado-en contenedor1 cinta2)
   goals met: 1 of 4
6. (dejar-blanco-pila muelle1 grua1 pila4 contenedor2 altura_muelle1_0 pila4 altura_muelle1_1)
   deleted: (ubicado-en contenedor2 grua1) (top pila4 pila4) (altura pila4 altura_muelle1_0)
   added: (libre grua1) (ubicado-en contenedor2 pila4) (encima contenedor2 pila4) (top contenedor2 pila4) (altura pila4 altura_muelle1_1) (disponible contenedor2)
   goals met: 2 of 4
7. (coger-pila muelle1 grua1 pila3 contenedor3 altura_muelle1_1 pila3 altura_muelle1_0)
   deleted: (libre grua1) (ubicado-en contenedor3 pila3) (top contenedor3 pila3) (encima contenedor3 pila3) (disponible contenedor3) (altura pila3 altura_muelle1_1)
   added: (ubicado-en contenedor3 grua1) (disponible pila3) (top pila3 pila3) (altura pila3 altura_muelle1_0)
   goals met: 2 of 4
8. (dejar-cinta cinta1 muelle1 muelle2 grua1 contenedor3)
   deleted: (ubicado-en contenedor3 grua1) (libre cinta1) (ubicado-en contenedor3 muelle1)
   added: (libre grua1) (ubicado-en contenedor3 cinta1)
   goals met: 2 of 4
9. (coger-cinta cinta2 muelle2 muelle1 grua1 contenedor1)
   deleted: (ubicado-en contenedor1 cinta2) (libre grua1)
   added: (libre cinta2) (ubicado-en contenedor1 grua1) (ubicado-en contenedor1 muelle1)
   goals met: 3 of 4
10. (dejar-blanco-pila muelle1 grua1 pila3 contenedor1 altura_muelle1_0 pila3 altura_muelle1_1)
   deleted: (ubicado-en contenedor1 grua1) (top pila3 pila3) (altura pila3 altura_muelle1_0) (disponible pila3)
   added: (libre grua1) (ubicado-en contenedor1 pila3) (encima contenedor1 pila3) (top contenedor1 pila3) (altura pila3 altura_muelle1_1) (disponible contenedor1)
   goals met: 4 of 4
